# SetRRDiam

## Description
Sets the diameters of a rounded rectangle.

```pascal
PROCEDURE SetRRDiam(
				h     : HANDLE;
				xDiam : REAL;
				yDiam : REAL);
```

```python
def vs.SetRRDiam(h, xDiam, yDiam):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|xDiam|REAL|   |
|yDiam|REAL|   |

## Version
Availability: from Vectorworks 2014

## Category
* Object Editing